{"class_name": "Functional", "config": {"name": "model_67", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_4"}, "name": "input_4", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "Conv2D_", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_", "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_", "inbound_nodes": [[["Conv2D_", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_", "inbound_nodes": [[["BatchNorm1_", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_0_0_0_1", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_0_0_0_1", "inbound_nodes": [[["Act1_", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_0_0_0_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_0_0_0_1", "inbound_nodes": [[["Conv2D_0_0_0_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_0_0_0_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_0_0_0_1", "inbound_nodes": [[["BatchNorm1_0_0_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_0_0_0_2", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_0_0_0_2", "inbound_nodes": [[["Act1_0_0_0_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_0_0_0_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_0_0_0_2", "inbound_nodes": [[["Conv2D_0_0_0_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_66", "trainable": true, "dtype": "float32"}, "name": "add_66", "inbound_nodes": [[["Act1_", 0, 0, {}], ["BatchNorm1_0_0_0_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_66", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_66", "inbound_nodes": [[["add_66", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_0_1_0_1", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_0_1_0_1", "inbound_nodes": [[["activation_66", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_0_1_0_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_0_1_0_1", "inbound_nodes": [[["Conv2D_0_1_0_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_0_1_0_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_0_1_0_1", "inbound_nodes": [[["BatchNorm1_0_1_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_0_1_0_2", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_0_1_0_2", "inbound_nodes": [[["Act1_0_1_0_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_0_1_0_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_0_1_0_2", "inbound_nodes": [[["Conv2D_0_1_0_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_67", "trainable": true, "dtype": "float32"}, "name": "add_67", "inbound_nodes": [[["activation_66", 0, 0, {}], ["BatchNorm1_0_1_0_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_67", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_67", "inbound_nodes": [[["add_67", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_1_0_0_1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_1_0_0_1", "inbound_nodes": [[["activation_67", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_1_0_0_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_1_0_0_1", "inbound_nodes": [[["Conv2D_1_0_0_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_1_0_0_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_1_0_0_1", "inbound_nodes": [[["BatchNorm1_1_0_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_1_0_0_2", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_1_0_0_2", "inbound_nodes": [[["Act1_1_0_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_1_0_0_3", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_1_0_0_3", "inbound_nodes": [[["activation_67", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_1_0_0_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_1_0_0_2", "inbound_nodes": [[["Conv2D_1_0_0_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_68", "trainable": true, "dtype": "float32"}, "name": "add_68", "inbound_nodes": [[["Conv2D_1_0_0_3", 0, 0, {}], ["BatchNorm1_1_0_0_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_68", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_68", "inbound_nodes": [[["add_68", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_1_1_0_1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_1_1_0_1", "inbound_nodes": [[["activation_68", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_1_1_0_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_1_1_0_1", "inbound_nodes": [[["Conv2D_1_1_0_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_1_1_0_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_1_1_0_1", "inbound_nodes": [[["BatchNorm1_1_1_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_1_1_0_2", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_1_1_0_2", "inbound_nodes": [[["Act1_1_1_0_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_1_1_0_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_1_1_0_2", "inbound_nodes": [[["Conv2D_1_1_0_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_69", "trainable": true, "dtype": "float32"}, "name": "add_69", "inbound_nodes": [[["activation_68", 0, 0, {}], ["BatchNorm1_1_1_0_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_69", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_69", "inbound_nodes": [[["add_69", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_1_2_0_1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_1_2_0_1", "inbound_nodes": [[["activation_69", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_1_2_0_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_1_2_0_1", "inbound_nodes": [[["Conv2D_1_2_0_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_1_2_0_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_1_2_0_1", "inbound_nodes": [[["BatchNorm1_1_2_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_1_2_0_2", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_1_2_0_2", "inbound_nodes": [[["Act1_1_2_0_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_1_2_0_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_1_2_0_2", "inbound_nodes": [[["Conv2D_1_2_0_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_70", "trainable": true, "dtype": "float32"}, "name": "add_70", "inbound_nodes": [[["activation_69", 0, 0, {}], ["BatchNorm1_1_2_0_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_70", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_70", "inbound_nodes": [[["add_70", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_1_3_0_1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_1_3_0_1", "inbound_nodes": [[["activation_70", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_1_3_0_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_1_3_0_1", "inbound_nodes": [[["Conv2D_1_3_0_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_1_3_0_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_1_3_0_1", "inbound_nodes": [[["BatchNorm1_1_3_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_1_3_0_2", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_1_3_0_2", "inbound_nodes": [[["Act1_1_3_0_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_1_3_0_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_1_3_0_2", "inbound_nodes": [[["Conv2D_1_3_0_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_71", "trainable": true, "dtype": "float32"}, "name": "add_71", "inbound_nodes": [[["activation_70", 0, 0, {}], ["BatchNorm1_1_3_0_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_71", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_71", "inbound_nodes": [[["add_71", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_1_4_0_1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_1_4_0_1", "inbound_nodes": [[["activation_71", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_1_4_0_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_1_4_0_1", "inbound_nodes": [[["Conv2D_1_4_0_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_1_4_0_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_1_4_0_1", "inbound_nodes": [[["BatchNorm1_1_4_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_1_4_0_2", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_1_4_0_2", "inbound_nodes": [[["Act1_1_4_0_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_1_4_0_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_1_4_0_2", "inbound_nodes": [[["Conv2D_1_4_0_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_72", "trainable": true, "dtype": "float32"}, "name": "add_72", "inbound_nodes": [[["activation_71", 0, 0, {}], ["BatchNorm1_1_4_0_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_72", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_72", "inbound_nodes": [[["add_72", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_1_5_0_1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_1_5_0_1", "inbound_nodes": [[["activation_72", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_1_5_0_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_1_5_0_1", "inbound_nodes": [[["Conv2D_1_5_0_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_1_5_0_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_1_5_0_1", "inbound_nodes": [[["BatchNorm1_1_5_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_1_5_0_2", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_1_5_0_2", "inbound_nodes": [[["Act1_1_5_0_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_1_5_0_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_1_5_0_2", "inbound_nodes": [[["Conv2D_1_5_0_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_73", "trainable": true, "dtype": "float32"}, "name": "add_73", "inbound_nodes": [[["activation_72", 0, 0, {}], ["BatchNorm1_1_5_0_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_73", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_73", "inbound_nodes": [[["add_73", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_1_6_0_1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_1_6_0_1", "inbound_nodes": [[["activation_73", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_1_6_0_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_1_6_0_1", "inbound_nodes": [[["Conv2D_1_6_0_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_1_6_0_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_1_6_0_1", "inbound_nodes": [[["BatchNorm1_1_6_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_1_6_0_2", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_1_6_0_2", "inbound_nodes": [[["Act1_1_6_0_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_1_6_0_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_1_6_0_2", "inbound_nodes": [[["Conv2D_1_6_0_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_74", "trainable": true, "dtype": "float32"}, "name": "add_74", "inbound_nodes": [[["activation_73", 0, 0, {}], ["BatchNorm1_1_6_0_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_74", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_74", "inbound_nodes": [[["add_74", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_1_7_0_1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_1_7_0_1", "inbound_nodes": [[["activation_74", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_1_7_0_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_1_7_0_1", "inbound_nodes": [[["Conv2D_1_7_0_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_1_7_0_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_1_7_0_1", "inbound_nodes": [[["BatchNorm1_1_7_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_1_7_0_2", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_1_7_0_2", "inbound_nodes": [[["Act1_1_7_0_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_1_7_0_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_1_7_0_2", "inbound_nodes": [[["Conv2D_1_7_0_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_75", "trainable": true, "dtype": "float32"}, "name": "add_75", "inbound_nodes": [[["activation_74", 0, 0, {}], ["BatchNorm1_1_7_0_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_75", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_75", "inbound_nodes": [[["add_75", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_1_8_0_1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_1_8_0_1", "inbound_nodes": [[["activation_75", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_1_8_0_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_1_8_0_1", "inbound_nodes": [[["Conv2D_1_8_0_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_1_8_0_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_1_8_0_1", "inbound_nodes": [[["BatchNorm1_1_8_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_1_8_0_2", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_1_8_0_2", "inbound_nodes": [[["Act1_1_8_0_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_1_8_0_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_1_8_0_2", "inbound_nodes": [[["Conv2D_1_8_0_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_76", "trainable": true, "dtype": "float32"}, "name": "add_76", "inbound_nodes": [[["activation_75", 0, 0, {}], ["BatchNorm1_1_8_0_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_76", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_76", "inbound_nodes": [[["add_76", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_2_0_0_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_2_0_0_1", "inbound_nodes": [[["activation_76", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_2_0_0_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_2_0_0_1", "inbound_nodes": [[["Conv2D_2_0_0_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_2_0_0_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_2_0_0_1", "inbound_nodes": [[["BatchNorm1_2_0_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_2_0_0_2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_2_0_0_2", "inbound_nodes": [[["Act1_2_0_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_2_0_0_3", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_2_0_0_3", "inbound_nodes": [[["activation_76", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_2_0_0_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_2_0_0_2", "inbound_nodes": [[["Conv2D_2_0_0_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_77", "trainable": true, "dtype": "float32"}, "name": "add_77", "inbound_nodes": [[["Conv2D_2_0_0_3", 0, 0, {}], ["BatchNorm1_2_0_0_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_77", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_77", "inbound_nodes": [[["add_77", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_2_1_0_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_2_1_0_1", "inbound_nodes": [[["activation_77", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_2_1_0_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_2_1_0_1", "inbound_nodes": [[["Conv2D_2_1_0_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_2_1_0_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_2_1_0_1", "inbound_nodes": [[["BatchNorm1_2_1_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_2_1_0_2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_2_1_0_2", "inbound_nodes": [[["Act1_2_1_0_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_2_1_0_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_2_1_0_2", "inbound_nodes": [[["Conv2D_2_1_0_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_78", "trainable": true, "dtype": "float32"}, "name": "add_78", "inbound_nodes": [[["activation_77", 0, 0, {}], ["BatchNorm1_2_1_0_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_78", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_78", "inbound_nodes": [[["add_78", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_2_2_0_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_2_2_0_1", "inbound_nodes": [[["activation_78", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_2_2_0_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_2_2_0_1", "inbound_nodes": [[["Conv2D_2_2_0_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_2_2_0_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_2_2_0_1", "inbound_nodes": [[["BatchNorm1_2_2_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_2_2_0_2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_2_2_0_2", "inbound_nodes": [[["Act1_2_2_0_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_2_2_0_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_2_2_0_2", "inbound_nodes": [[["Conv2D_2_2_0_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_79", "trainable": true, "dtype": "float32"}, "name": "add_79", "inbound_nodes": [[["activation_78", 0, 0, {}], ["BatchNorm1_2_2_0_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_79", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_79", "inbound_nodes": [[["add_79", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_2_3_0_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_2_3_0_1", "inbound_nodes": [[["activation_79", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_2_3_0_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, 