{"class_name": "Functional", "config": {"name": "model_186", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_11"}, "name": "input_11", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "Conv2D_", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_", "inbound_nodes": [[["input_11", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_", "inbound_nodes": [[["Conv2D_", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_", "inbound_nodes": [[["BatchNorm1_", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_0_0_0_1", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_0_0_0_1", "inbound_nodes": [[["Act1_", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_0_0_0_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_0_0_0_1", "inbound_nodes": [[["Conv2D_0_0_0_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_0_0_0_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_0_0_0_1", "inbound_nodes": [[["BatchNorm1_0_0_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_0_0_0_2", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_0_0_0_2", "inbound_nodes": [[["Act1_0_0_0_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_0_0_0_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_0_0_0_2", "inbound_nodes": [[["Conv2D_0_0_0_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_185", "trainable": true, "dtype": "float32"}, "name": "add_185", "inbound_nodes": [[["Act1_", 0, 0, {}], ["BatchNorm1_0_0_0_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_185", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_185", "inbound_nodes": [[["add_185", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_0_1_0_1", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_0_1_0_1", "inbound_nodes": [[["activation_185", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_0_1_0_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_0_1_0_1", "inbound_nodes": [[["Conv2D_0_1_0_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_0_1_0_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_0_1_0_1", "inbound_nodes": [[["BatchNorm1_0_1_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_0_1_0_2", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_0_1_0_2", "inbound_nodes": [[["Act1_0_1_0_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_0_1_0_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_0_1_0_2", "inbound_nodes": [[["Conv2D_0_1_0_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_186", "trainable": true, "dtype": "float32"}, "name": "add_186", "inbound_nodes": [[["activation_185", 0, 0, {}], ["BatchNorm1_0_1_0_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_186", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_186", "inbound_nodes": [[["add_186", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_1_0_0_1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_1_0_0_1", "inbound_nodes": [[["activation_186", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_1_0_0_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_1_0_0_1", "inbound_nodes": [[["Conv2D_1_0_0_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_1_0_0_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_1_0_0_1", "inbound_nodes": [[["BatchNorm1_1_0_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_1_0_0_2", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_1_0_0_2", "inbound_nodes": [[["Act1_1_0_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_1_0_0_3", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_1_0_0_3", "inbound_nodes": [[["activation_186", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_1_0_0_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_1_0_0_2", "inbound_nodes": [[["Conv2D_1_0_0_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_187", "trainable": true, "dtype": "float32"}, "name": "add_187", "inbound_nodes": [[["Conv2D_1_0_0_3", 0, 0, {}], ["BatchNorm1_1_0_0_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_187", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_187", "inbound_nodes": [[["add_187", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_1_1_0_1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_1_1_0_1", "inbound_nodes": [[["activation_187", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_1_1_0_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_1_1_0_1", "inbound_nodes": [[["Conv2D_1_1_0_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_1_1_0_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_1_1_0_1", "inbound_nodes": [[["BatchNorm1_1_1_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_1_1_0_2", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_1_1_0_2", "inbound_nodes": [[["Act1_1_1_0_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_1_1_0_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_1_1_0_2", "inbound_nodes": [[["Conv2D_1_1_0_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_188", "trainable": true, "dtype": "float32"}, "name": "add_188", "inbound_nodes": [[["activation_187", 0, 0, {}], ["BatchNorm1_1_1_0_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_188", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_188", "inbound_nodes": [[["add_188", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_2_0_0_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_2_0_0_1", "inbound_nodes": [[["activation_188", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_2_0_0_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_2_0_0_1", "inbound_nodes": [[["Conv2D_2_0_0_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_2_0_0_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_2_0_0_1", "inbound_nodes": [[["BatchNorm1_2_0_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_2_0_0_2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_2_0_0_2", "inbound_nodes": [[["Act1_2_0_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_2_0_0_3", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_2_0_0_3", "inbound_nodes": [[["activation_188", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_2_0_0_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_2_0_0_2", "inbound_nodes": [[["Conv2D_2_0_0_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_189", "trainable": true, "dtype": "float32"}, "name": "add_189", "inbound_nodes": [[["Conv2D_2_0_0_3", 0, 0, {}], ["BatchNorm1_2_0_0_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_189", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_189", "inbound_nodes": [[["add_189", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_2_1_0_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_2_1_0_1", "inbound_nodes": [[["activation_189", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_2_1_0_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_2_1_0_1", "inbound_nodes": [[["Conv2D_2_1_0_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_2_1_0_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_2_1_0_1", "inbound_nodes": [[["BatchNorm1_2_1_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_2_1_0_2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_2_1_0_2", "inbound_nodes": [[["Act1_2_1_0_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_2_1_0_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_2_1_0_2", "inbound_nodes": [[["Conv2D_2_1_0_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_190", "trainable": true, "dtype": "float32"}, "name": "add_190", "inbound_nodes": [[["activation_189", 0, 0, {}], ["BatchNorm1_2_1_0_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_190", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_190", "inbound_nodes": [[["add_190", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_2_2_0_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_2_2_0_1", "inbound_nodes": [[["activation_190", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_2_2_0_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_2_2_0_1", "inbound_nodes": [[["Conv2D_2_2_0_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_2_2_0_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_2_2_0_1", "inbound_nodes": [[["BatchNorm1_2_2_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_2_2_0_2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_2_2_0_2", "inbound_nodes": [[["Act1_2_2_0_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_2_2_0_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_2_2_0_2", "inbound_nodes": [[["Conv2D_2_2_0_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_191", "trainable": true, "dtype": "float32"}, "name": "add_191", "inbound_nodes": [[["activation_190", 0, 0, {}], ["BatchNorm1_2_2_0_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_191", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_191", "inbound_nodes": [[["add_191", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_2_3_0_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_2_3_0_1", "inbound_nodes": [[["activation_191", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_2_3_0_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_2_3_0_1", "inbound_nodes": [[["Conv2D_2_3_0_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_2_3_0_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_2_3_0_1", "inbound_nodes": [[["BatchNorm1_2_3_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_2_3_0_2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_2_3_0_2", "inbound_nodes": [[["Act1_2_3_0_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_2_3_0_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_2_3_0_2", "inbound_nodes": [[["Conv2D_2_3_0_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_192", "trainable": true, "dtype": "float32"}, "name": "add_192", "inbound_nodes": [[["activation_191", 0, 0, {}], ["BatchNorm1_2_3_0_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_192", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_192", "inbound_nodes": [[["add_192", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_2_4_0_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_2_4_0_1", "inbound_nodes": [[["activation_192", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_2_4_0_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_2_4_0_1", "inbound_nodes": [[["Conv2D_2_4_0_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_2_4_0_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_2_4_0_1", "inbound_nodes": [[["BatchNorm1_2_4_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_2_4_0_2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_2_4_0_2", "inbound_nodes": [[["Act1_2_4_0_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_2_4_0_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_2_4_0_2", "inbound_nodes": [[["Conv2D_2_4_0_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_193", "trainable": true, "dtype": "float32"}, "name": "add_193", "inbound_nodes": [[["activation_192", 0, 0, {}], ["BatchNorm1_2_4_0_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_193", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_193", "inbound_nodes": [[["add_193", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_2_5_0_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_2_5_0_1", "inbound_nodes": [[["activation_193", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_2_5_0_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_2_5_0_1", "inbound_nodes": [[["Conv2D_2_5_0_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_2_5_0_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_2_5_0_1", "inbound_nodes": [[["BatchNorm1_2_5_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_2_5_0_2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_2_5_0_2", "inbound_nodes": [[["Act1_2_5_0_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_2_5_0_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_2_5_0_2", "inbound_nodes": [[["Conv2D_2_5_0_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_194", "trainable": true, "dtype": "float32"}, "name": "add_194", "inbound_nodes": [[["activation_193", 0, 0, {}], ["BatchNorm1_2_5_0_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_194", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_194", "inbound_nodes": [[["add_194", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_2_6_0_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_2_6_0_1", "inbound_nodes": [[["activation_194", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_2_6_0_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_2_6_0_1", "inbound_nodes": [[["Conv2D_2_6_0_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_2_6_0_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_2_6_0_1", "inbound_nodes": [[["BatchNorm1_2_6_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_2_6_0_2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_2_6_0_2", "inbound_nodes": [[["Act1_2_6_0_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_2_6_0_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_2_6_0_2", "inbound_nodes": [[["Conv2D_2_6_0_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_195", "trainable": true, "dtype": "float32"}, "name": "add_195", "inbound_nodes": [[["activation_194", 0, 0, {}], ["BatchNorm1_2_6_0_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_195", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_195", "inbound_nodes": [[["add_195", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_2_7_0_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_2_7_0_1", "inbound_nodes": [[["activation_195", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_2_7_0_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_2_7_0_1", "inbound_nodes": [[["Conv2D_2_7_0_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_2_7_0_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_2_7_0_1", "inbound_nodes": [[["BatchNorm1_2_7_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_2_7_0_2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_2_7_0_2", "inbound_nodes": [[["Act1_2_7_0_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_2_7_0_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_2_7_0_2", "inbound_nodes": [[["Conv2D_2_7_0_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_196", "trainable": true, "dtype": "float32"}, "name": "add_196", "inbound_nodes": [[["activation_195", 0, 0, {}], ["BatchNorm1_2_7_0_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_196", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_196", "inbound_nodes": [[["add_196", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_2_8_0_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_2_8_0_1", "inbound_nodes": [[["activation_196", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_2_8_0_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_2_8_0_1", "inbound_nodes": [[["Conv2D_2_8_0_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_2_8_0_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_2_8_0_1", "inbound_nodes": [[["BatchNorm1_2_8_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_2_8_0_2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_2_8_0_2", "inbound_nodes": [[["Act1_2_8_0_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_2_8_0_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_2_8_0_2", "inbound_nodes": [[["Conv2D_2_8_0_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_197", "trainable": true, "dtype": "float32"}, "name": "add_197", "inbound_nodes": [[["activation_196", 0, 0, {}], ["BatchNorm1_2_8_0_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_197", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_197", "inbound_nodes": [[["add_197", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_10", "trainable": true, "dtype": "float32", "pool_size": [8, 8], "padding": "valid", "strides": [8, 8], "data_format": "channels_last"}, "name": "average_pooling2d_10", "inbound_nodes": [[["activation_197", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_10", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_10", "inbound_nodes": [[["average_pooling2d_10", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_10", "trainable": true, "dtype": "float32", "units": 10, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_10", "inbound_nodes": [[["flatten_10", 0, 0, {}]]]}], "input_layers": [["input_11", 0, 0]], "output_layers": [["dense_10", 0, 0]]}, "keras_version": "2.9.0", "backend": "tensorflow"}