{"class_name": "Functional", "config": {"name": "model_305", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_18"}, "name": "input_18", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "Conv2D_", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_", "inbound_nodes": [[["input_18", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_", "inbound_nodes": [[["Conv2D_", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_", "inbound_nodes": [[["BatchNorm1_", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_0_0_0_1", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_0_0_0_1", "inbound_nodes": [[["Act1_", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_0_0_0_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_0_0_0_1", "inbound_nodes": [[["Conv2D_0_0_0_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_0_0_0_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_0_0_0_1", "inbound_nodes": [[["BatchNorm1_0_0_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_0_0_0_2", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_0_0_0_2", "inbound_nodes": [[["Act1_0_0_0_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_0_0_0_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_0_0_0_2", "inbound_nodes": [[["Conv2D_0_0_0_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_255", "trainable": true, "dtype": "float32"}, "name": "add_255", "inbound_nodes": [[["Act1_", 0, 0, {}], ["BatchNorm1_0_0_0_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_255", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_255", "inbound_nodes": [[["add_255", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_0_1_0_1", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_0_1_0_1", "inbound_nodes": [[["activation_255", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_0_1_0_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_0_1_0_1", "inbound_nodes": [[["Conv2D_0_1_0_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_0_1_0_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_0_1_0_1", "inbound_nodes": [[["BatchNorm1_0_1_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_0_1_0_2", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_0_1_0_2", "inbound_nodes": [[["Act1_0_1_0_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_0_1_0_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_0_1_0_2", "inbound_nodes": [[["Conv2D_0_1_0_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_256", "trainable": true, "dtype": "float32"}, "name": "add_256", "inbound_nodes": [[["activation_255", 0, 0, {}], ["BatchNorm1_0_1_0_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_256", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_256", "inbound_nodes": [[["add_256", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_1_0_0_1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_1_0_0_1", "inbound_nodes": [[["activation_256", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_1_0_0_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_1_0_0_1", "inbound_nodes": [[["Conv2D_1_0_0_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_1_0_0_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_1_0_0_1", "inbound_nodes": [[["BatchNorm1_1_0_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_1_0_0_2", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_1_0_0_2", "inbound_nodes": [[["Act1_1_0_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_1_0_0_3", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_1_0_0_3", "inbound_nodes": [[["activation_256", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_1_0_0_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_1_0_0_2", "inbound_nodes": [[["Conv2D_1_0_0_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_257", "trainable": true, "dtype": "float32"}, "name": "add_257", "inbound_nodes": [[["Conv2D_1_0_0_3", 0, 0, {}], ["BatchNorm1_1_0_0_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_257", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_257", "inbound_nodes": [[["add_257", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_1_1_0_1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_1_1_0_1", "inbound_nodes": [[["activation_257", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_1_1_0_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_1_1_0_1", "inbound_nodes": [[["Conv2D_1_1_0_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_1_1_0_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_1_1_0_1", "inbound_nodes": [[["BatchNorm1_1_1_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_1_1_0_2", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_1_1_0_2", "inbound_nodes": [[["Act1_1_1_0_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_1_1_0_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_1_1_0_2", "inbound_nodes": [[["Conv2D_1_1_0_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_258", "trainable": true, "dtype": "float32"}, "name": "add_258", "inbound_nodes": [[["activation_257", 0, 0, {}], ["BatchNorm1_1_1_0_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_258", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_258", "inbound_nodes": [[["add_258", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_2_0_0_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_2_0_0_1", "inbound_nodes": [[["activation_258", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_2_0_0_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_2_0_0_1", "inbound_nodes": [[["Conv2D_2_0_0_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_2_0_0_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_2_0_0_1", "inbound_nodes": [[["BatchNorm1_2_0_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_2_0_0_2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_2_0_0_2", "inbound_nodes": [[["Act1_2_0_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_2_0_0_3", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_2_0_0_3", "inbound_nodes": [[["activation_258", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_2_0_0_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_2_0_0_2", "inbound_nodes": [[["Conv2D_2_0_0_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_259", "trainable": true, "dtype": "float32"}, "name": "add_259", "inbound_nodes": [[["Conv2D_2_0_0_3", 0, 0, {}], ["BatchNorm1_2_0_0_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_259", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_259", "inbound_nodes": [[["add_259", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_2_1_0_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_2_1_0_1", "inbound_nodes": [[["activation_259", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_2_1_0_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_2_1_0_1", "inbound_nodes": [[["Conv2D_2_1_0_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Act1_2_1_0_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Act1_2_1_0_1", "inbound_nodes": [[["BatchNorm1_2_1_0_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D_2_1_0_2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D_2_1_0_2", "inbound_nodes": [[["Act1_2_1_0_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm1_2_1_0_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm1_2_1_0_2", "inbound_nodes": [[["Conv2D_2_1_0_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_260", "trainable": true, "dtype": "float32"}, "name": "add_260", "inbound_nodes": [[["activation_259", 0, 0, {}], ["BatchNorm1_2_1_0_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_260", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_260", "inbound_nodes": [[["add_260", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_17", "trainable": true, "dtype": "float32", "pool_size": [8, 8], "padding": "valid", "strides": [8, 8], "data_format": "channels_last"}, "name": "average_pooling2d_17", "inbound_nodes": [[["activation_260", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_17", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_17", "inbound_nodes": [[["average_pooling2d_17", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_17", "trainable": true, "dtype": "float32", "units": 10, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_17", "inbound_nodes": [[["flatten_17", 0, 0, {}]]]}], "input_layers": [["input_18", 0, 0]], "output_layers": [["dense_17", 0, 0]]}, "keras_version": "2.9.0", "backend": "tensorflow"}